In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('students.db')

In [3]:
cur = conn.cursor()

In [4]:
def display_as_table(data, headers):
    df = pd.DataFrame(data=data, columns=[i[0] for i in headers])
    return df

In [5]:
#create Student table
cur.execute("Create Table Students(Name text, GPA float, Major text, Year integer)")

OperationalError: table Students already exists

In [6]:
cur.execute("SELECT * FROM Students")

In [7]:
display_as_table(cur.fetchall(), cur.description)

   Name  GPA Major  Year
0  Yoda  3.8  Math     3
1  Yoda  3.8  Math     3

In [8]:
#Insert Stuff

In [9]:
cur.execute("INSERT INTO Students VALUES ('Yoda', 3.8, 'Math', 3)")
cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

   Name  GPA Major  Year
0  Yoda  3.8  Math     3
1  Yoda  3.8  Math     3
2  Yoda  3.8  Math     3

In [10]:
conn.commit()

In [11]:
#Insert a few more row

In [12]:
cur.execute('''INSERT INTO Students VALUES
    ('Vader', 2.8, 'Math', 1),
    ('Rey', 3.9, 'Physics', 2),
    ('Kylo', 2.9, 'History', 3),
    ('Snoke', 3.5, 'Art', 4),
    ('Finn', 3.2, 'Art', 3),
    ('Han', 3.7, 'Math', 2),
    ('Luke', 3.0, 'History', 1)''')

In [13]:
# display the Student table
cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA    Major  Year
0   Yoda  3.8     Math     3
1   Yoda  3.8     Math     3
2   Yoda  3.8     Math     3
3  Vader  2.8     Math     1
4    Rey  3.9  Physics     2
5   Kylo  2.9  History     3
6  Snoke  3.5      Art     4
7   Finn  3.2      Art     3
8    Han  3.7     Math     2
9   Luke  3.0  History     1

In [14]:
conn.commit()

In [15]:
cur.execute("SELECT Name, GPA FROM Students WHERE GPA > 3.2")
display_as_table(cur.fetchall(), cur.description)

    Name  GPA
0   Yoda  3.8
1   Yoda  3.8
2   Yoda  3.8
3    Rey  3.9
4  Snoke  3.5
5    Han  3.7

In [16]:
# Insert record only for certain columns

In [17]:
cur.execute("INSERT INTO Students (Name, Major, Year) VALUES('Maul', 'Math', 1)")
cur.execute("SELECT * FROM Students")
display_as_table(cur.fetchall(), cur.description)

     Name  GPA    Major  Year
0    Yoda  3.8     Math     3
1    Yoda  3.8     Math     3
2    Yoda  3.8     Math     3
3   Vader  2.8     Math     1
4     Rey  3.9  Physics     2
5    Kylo  2.9  History     3
6   Snoke  3.5      Art     4
7    Finn  3.2      Art     3
8     Han  3.7     Math     2
9    Luke  3.0  History     1
10   Maul  NaN     Math     1

In [18]:
conn.commit()

In [19]:
#Insert records from another table

In [ ]:
#Insert New Students table into Students
#curr.execute("INSERT INTO Students SELECT * FROM New Studens")